app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT 1
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT 1
---
  def index
    @posts = Post.all


    cache "post_controller_#{@posts.count}" do
      users = User.all

INSERT INTO "posts" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 20 Feb 2015 16:16:22 UTC +00:00], ["name", "germkgjreklj"], ["updated_at", Fri, 20 Feb 2015 16:16:22 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "name" = 'germkgjreklj gkjeprgjepr', "updated_at" = '2015-02-20 16:16:27.953570' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])