app/controllers/users_controller.rb

  def index

cache "users_controller" do
    @users = User.all
    users = User.first
    post = Post.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT 1
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT 1

  def show
    @error_message = "Hello im here"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    debugger
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 07 Mar 2015 09:31:38 UTC +00:00], ["name", "test"], ["title", "test"], ["updated_at", Sat, 07 Mar 2015 09:31:38 UTC +00:00]]